[
    "Stay hydrated! Aim for 8-10 glasses of water a day to support increased blood volume.",
    "Take your prenatal vitamins daily to ensure you and baby get essential nutrients.",
    "Rest when you can. Your body is doing a lot of work growing a new life!",
    "Gentle exercise like walking or swimming can boost your mood and energy.",
    "Eat small, frequent meals to help manage nausea and heartburn.",
    "Listen to your body. If you feel tired, sleep. If you're hungry, eat nutritious snacks.",
    "Avoid raw or undercooked meats, eggs, and certain fish high in mercury.",
    "Practice pelvic floor exercises (Kegels) to strengthen muscles for labor.",
    "Moisturize your belly to help with itching as your skin stretches.",
    "Sleep on your side, preferably the left, for better blood flow to the baby.",
    "Connect with your partner and share your feelings about the pregnancy.",
    "Take photos of your growing bump to cherish these memories later.",
    "Educate yourself about breastfeeding and newborn care.",
    "Pack your hospital bag early, around 36 weeks, just in case.",
    "Track your baby's kicks starting around 28 weeks.",
    "Limit caffeine intake to 200mg per day (about one 12oz cup of coffee).",
    "Attend your prenatal appointments to monitor baby's growth and your health.",
    "Join a prenatal yoga class to help with flexibility and relaxation.",
    "Wear comfortable, supportive shoes as your center of gravity shifts.",
    "Trust your instincts. If something feels off, contact your healthcare provider.",
    "Include plenty of iron-rich foods like palak paneer and methi parathas in your diet.",
    "Soak almonds (badam) overnight and eat them first thing in the morning for protein and healthy fats.",
    "Drink coconut water (nariyal pani) regularly to stay hydrated and replenish electrolytes.",
    "Enjoy homemade ghee in moderation; it helps with digestion and provides energy.",
    "Try roasted makhana (fox nuts) as a healthy, crunchy snack instead of fried chips.",
    "Practice gentle prenatal yoga or 'garbha sanskar' techniques for bonding with your baby.",
    "Listen to soothing classical Indian ragas or mantras to relax your mind and baby.",
    "Include dates (khajoor) in your diet for natural iron and energy.",
    "Avoid papaya (papeeta) and pineapple, especially in the first trimester, as per traditional beliefs.",
    "Drink warm milk with a pinch of turmeric (haldi) and saffron (kesar) for immunity and good sleep.",
    "Wear cotton clothes, especially kurtis and loose pants, to stay comfortable in the heat.",
    "Massaging your belly with coconut or almond oil can help reduce itchiness and stretch marks.",
    "Include curd or buttermilk (chaas) with meals to aid digestion and cooldown the body.",
    "Eat a handful of soaked walnuts (akhrot) for baby's brain development (DHA).",
    "Avoid heavy, spicy, and oily curries if you are experiencing heartburn or acidity.",
    "Try cumin water (jeera pani) for relief from bloating and indigestion.",
    "Engage with your family elders; their positive stories can be very reassuring.",
    "Plan your 'Godh Bharai' (baby shower) ceremony comfortably around the 7th month.",
    "Start looking for a 'Japa maid' or postnatal massage expert well in advance.",
    "Include ragi (finger millet) in your diet as porridge or dosa for calcium.",
    "Eat fresh, homemade food as much as possible to avoid infections.",
    "Practice deep breathing (Pranayama) like Anulom Vilom for stress relief.",
    "Avoid lifting heavy buckets or moving furniture, a common household chore.",
    "Squatting (malasana) can be a great exercise for pelvic floor strength, but consult your doctor first.",
    "Keep a small box of fennel seeds (saunf) or mishri handy for nausea relief.",
    "Include lentils (dal), especially moong dal, which is easy to digest.",
    "Don't skip breakfast; try upma, poha, or idli with lots of veggies.",
    "Stay active but avoid strenuous household work like sweeping or mopping in later stages.",
    "Take short naps in the afternoon, commonly known as 'takiya time'!",
    "Read books on parenting or spiritual texts like the Gita or Ramayana if it brings you peace.",
    "Ensure your iron and calcium supplements are taken at different times for better absorption.",
    "If you have swelling, rest with your feet elevated on pillows.",
    "Drink plenty of water, but avoid drinking immediately before or after meals to aid digestion.",
    "Eat sprouted moong or chana for a protein-packed snack.",
    "Avoid street food like pani puri or chaat from unhygienic places to prevent infections.",
    "Include seasonal fruits like pomegranate (anar) and chikoo for vitamins.",
    "Talk to your baby in your mother tongue; they start listening from the womb.",
    "Prepare a hospital bag with comfortable nursing kurtis or gowns.",
    "Discuss postpartum traditions and confinement practices with your mother or mother-in-law.",
    "Ask your partner to massage your feet if they are swollen or tired.",
    "Avoid caffeinated tea/coffee; try herbal teas like ginger or lemon tea instead.",
    "Walk for 15-20 minutes after dinner to help with digestion and sleep.",
    "Use a pregnancy pillow or extra pillows between your legs for better sleep posture.",
    "Eat jaggery (gud) instead of white sugar for a healthier iron-rich sweetener.",
    "Include amla (Indian gooseberry) in your diet for Vitamin C and immunity.",
    "Avoid raw sprouts; always steam or cook them to prevent bacterial infections.",
    "Practice gratitude and positive affirmations ('Garbh Samvad') daily.",
    "Wear flat, comfortable footwear (chappals) with good grip.",
    "Avoid travelling on bumpy roads or two-wheelers during the first and last trimesters.",
    "Keep your medical file and reports organized in one folder for every visit.",
    "Eat small meals every 2-3 hours to keep your blood sugar stable.",
    "Include paneer (cottage cheese) in your diet for calcium and protein.",
    "Try coriander water or mint juice to settle morning sickness.",
    "Avoid excessive salt in pickles (achar) and papads to manage water retention.",
    "Ask your doctor about safe levels of saffron (kesar) consumption.",
    "Listen to your body's hunger cues and don't worry excessively about 'eating for two'.",
    "Moisturize your skin immediately after a bath to lock in hydration.",
    "Avoid hot baths or saunas; stick to lukewarm water for bathing.",
    "Include green leafy vegetables like methi (fenugreek) and sarson (mustard greens).",
    "Avoid artificial sweeteners and processed foods with preservatives.",
    "Stay connected with friends who are also mothers for support and advice.",
    "Learn about signs of labor so you know when to go to the hospital.",
    "Prepare laddoos with dry fruits, ghee, and edible gum (gond) for postpartum strength (check with doctor).",
    "Maintain good oral hygiene; gum bleeding is common but needs care.",
    "Use a squat stool (Indian toilet posture) if comfortable, it aids in bowel movement.",
    "Avoid wearing tight clothes; opt for breathable cotton fabrics.",
    "Keep emergency contact numbers saved and easily accessible.",
    "Watch funny movies or shows; laughter is great for you and the baby.",
    "Practice mindfulness or meditation to manage prenatal anxiety.",
    "Include seeds like pumpkin, sunflower, and flaxseeds in your diet.",
    "Avoid carrying heavy grocery bags.",
    "Plan for help with household chores for the first few weeks after delivery.",
    "Understand the benefits of breastfeeding for both you and your baby.",
    "Attend antenatal classes with your husband so he understands the process.",
    "Eat dinner early (closer to sunset) to prevent indigestion at night.",
    "Avoid sleeping on your back after the first trimester; side sleeping is best.",
    "Check your blood pressure regularly if advised by your doctor.",
    "Avoid stressful news or movies; keep your environment positive.",
    "Ask family members to wash hands before touching your belly or you.",
    "Include soups like tomato, spinach, or mixed veg specially in winters.",
    "Avoid bending from the waist; bend your knees to pick things up.",
    "Take care of your back; sit with proper support.",
    "Massage your perineum with oil (after 34 weeks) if advised, to prevent tearing.",
    "Visualize a smooth and safe delivery daily.",
    "Eat a banana daily; it's great for potassium and helps with leg cramps.",
    "Avoid self-medication for headaches or colds; always ask your doctor.",
    "Stay cool in summers with jaljeera, kokum sharbat, or aam panna.",
    "Avoid overheating; dress in layers.",
    "Connect with your baby by gently rubbing your belly.",
    "Keep a journal of your pregnancy journey and feelings.",
    "Plan your maternity leave and work handover in advance.",
    "Discuss birth control options for after delivery with your doctor.",
    "Learn about cord blood banking and decide if it's right for you.",
    "Prepare your older child (if any) for the new arrival.",
    "Celebrate small milestones like the first kick or hearing the heartbeat.",
    "Take pictures of your ultrasound scans.",
    "Remember that every pregnancy is unique; don't compare yours to others.",
    "Be kind to yourself; your body is doing amazing work."
]